ThirdParty-v2012/swak4Foam-latest/Examples/tests/conditionalWriting/movingConeDistortedRandom/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      motionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh dynamicMotionSolverFvMesh;

motionSolverLibs ("libfvMotionSolvers.so");

solver velocityLaplacian;
// solver velocityComponentLaplacian x;

diffusivity  uniform;
// diffusivity  directional (1 200 0);
// diffusivity  motionDirectional (1 1000 0);
// diffusivity  inverseDistance 1(movingWall);
// diffusivity  file motionDiffusivity;
// diffusivity  quadratic inverseDistance 1(movingWall);
// diffusivity  exponential 2000 inverseDistance 1(movingWall);

velocityLaplacianCoeffs {
    diffusivity  uniform;
}

// ************************************************************************* //
