ThirdParty-v2012/swak4Foam-latest/Examples/tests/conditionalWriting/movingConeDistortedRandom/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    movingWall      
    {
        type            zeroGradient;
    }

    farFieldMoving  
    {
        type            zeroGradient;
    }

    fixedWall       
    {
        type            zeroGradient;
    }

    axis            
    {
        type            symmetryPlane;
    }

    left            
    {
        type            totalPressure;
        p0              uniform 0;
        U               U;
        phi             phi;
        rho             none;
        psi             none;
        gamma           1;
        value           uniform 0;
    }

    farField        
    {
        type            zeroGradient;
    }

    back            
    {
        type            wedge;
    }

    front           
    {
        type            wedge;
    }
}

// ************************************************************************* //
