ThirdParty-v2012/swak4Foam-latest/Examples/tests/conditionalWriting/movingConeDistortedRandom/0/cellMotionUx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      motionU;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    movingWall
    {
        type            groovyBC;
        value           uniform 1;
        valueExpression "toFace(pointMotionUx)";
    }
    farFieldMoving
    {
        type            slip;
    }
    fixedWall
    {
        type            fixedValue;
        value           uniform 0;
    }
    axis
    {
        type            symmetryPlane;
    }
    left
    {
        type            fixedValue;
        value           uniform 0;
    }
    farField
    {
        type            slip;
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
}

// ************************************************************************* //
